//                                      Урок от 09/16
//=====================================================================================

// 5. Заполнить массив числами от 0 до 20 включительно, за исключением чисел, кратных 5

// const arr = []
// let g = 0;
// for( i = 0; i <= 20; i++) {
//     if (i % 5 != 0) {
//       arr [g] = i;
//       g++
//     }
// }
// console.log(arr) 

//=====   или другой вариант  ======

// const arr = []
// let g = 0;
// for( i = 0; i <= 20; i++) {
//     if (i % 5 != 0) {
//       arr.push(i);
//     }
// }
// console.log(arr) 


//                                      Урок от 
//=====================================================================================
