//                   ЛОГИЧЕСКОЕ ПРЕОБРАЗОВАНИЕ
//        0, null, undefined, NaN (пустая строка), "" -> false
//                любоe другое значение -> true

//console.log(Boolean(0));                     //false
//console.log(Boolean(Infinity));              //true
//console.log(Boolean(1222));                  //true

//могут быть значения булевые:       true - конвектируется как 1                                                   false как 0
// let value = null;
// console.log (Number(value));

// let value = "string";                //-> NaN
// console.log (+value);

//                              &&   &&
//============================================================================
//                            T && T == T
//                            T && F == F
//                            F && T == F
//                            F && F == F
//  УСЛОВИЕ  && && -> программа ищет в 1ю очередь первое ложное значение    
//console.log(1 && null && 2);
// выведет null                                                                 отработала, дальше null/ дальше она не будет отрабатывать


//                              ||   ||
//============================================================================
//                            T || T == T
//                            T || F == T
//                            F || T == T
//                            F || F == F
//     УСЛОВИЕ   ||   ||   программа ищет первое правдивое утверждение     
//console.log(null || 2 || undefined);
//после null 1e правдивое утверждение это 2


//                              ||   &&
//============================================================================
//console.log(1 || null && 2);
// 1 true,  значит 1е правдивое утверждение и берет

