// for (let i = 5; i >= 1; i--) { //отвечает за количество строк
//     let str = "";
//     for (let j = 9 ; j >= 1 ; j--) { //отвечает за наполнение строки
//       str = str + j;
//     }
//       console.log(str);
//   }

// вот во внутреннем цикле можно выводить по уменьшению числа, если хотим использовать j--, 
// попробуйте запустите код у себя

// for (let i = 5; i >= 1; i--) { //отвечает за количество строк
//   let str = "";
//   for (let j = i ; j >= 1 ; j--) { //отвечает за наполнение строки
//     str = str + j;
//   }
//     console.log(str);
// }