//Динамичное программирование - так нельзя
// let test1 =[28, 16, 37, 21, 17, 27, 3, 13, 0, 19, 24, 3]
// let arr1 = test1.map(el => test1.slice(0, 3))  //(0, 3)- от какого эл. и до каого не включая 3эл.
// console.log(arr1)

//как работает:
// iter = 1, el 28, [28, 16, 37, 21, 17, 27, 3, 13, 0, 19, 24, 3]
// arr1 = [[28, 16, 37]]
// iter = 2, el 17, [21, 17, 27, 3, 13, 0, 19, 24, 3]
// arr1 = [[28, 16, 37], [21, 17, 27]]
// iter = 3 [3, 13, 10, 19, 24, 3]
// arr1 = [[28, 16, 37], [21, 17, 27] [ 3, 13, 0]]
// iter = 4, el underfined, [19, 24, 3]